## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.aks-monitoring.azurerm_dashboard_grafana.aks_grafana has changed
  ~ resource "azurerm_dashboard_grafana" "aks_grafana" {
        id                                     = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/prvaks-monitoring-rg/providers/Microsoft.Dashboard/grafana/prvaks-grafana"
        name                                   = "prvaks-grafana"
        tags                                   = {
            "Environment" = "Dev"
            "Owner"       = "kmiszel"
            "Source"      = "Terraform"
        }
        # (12 unchanged attributes hidden)

      ~ identity {
          + identity_ids = []
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster_extension.flux["blue"] will be created
  + resource "azurerm_kubernetes_cluster_extension" "flux" {
      + aks_assigned_identity = (known after apply)
      + cluster_id            = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.ContainerService/managedClusters/prvaks-blue"
      + current_version       = (known after apply)
      + extension_type        = "microsoft.flux"
      + id                    = (known after apply)
      + name                  = "flux"
      + release_namespace     = (known after apply)
      + release_train         = (known after apply)
      + target_namespace      = (known after apply)
    }

  # azurerm_kubernetes_flux_configuration.example["blue"] will be created
  + resource "azurerm_kubernetes_flux_configuration" "example" {
      + cluster_id                        = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.ContainerService/managedClusters/prvaks-blue"
      + continuous_reconciliation_enabled = true
      + id                                = (known after apply)
      + name                              = "fluxconf"
      + namespace                         = "flux"
      + scope                             = "namespace"

      + git_repository {
          + reference_type           = "branch"
          + reference_value          = "main"
          + sync_interval_in_seconds = 600
          + timeout_in_seconds       = 600
          + url                      = "https://github.com/MISZELorg/aksapps"
        }

      + kustomizations {
          + depends_on                 = []
          + garbage_collection_enabled = false
          + name                       = "kustomization-1"
          + recreating_enabled         = false
          + retry_interval_in_seconds  = 600
          + sync_interval_in_seconds   = 600
          + timeout_in_seconds         = 600
            # (1 unchanged attribute hidden)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>